Revit 2027 API
ElementMulticategoryFilter(ICollection<BuiltInCategory>) Constructor
 Constructs a new instance of a filter to match elements by built-in category.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementMulticategoryFilter(
	ICollection<BuiltInCategory> categories
)
Public Sub New (
	categories As ICollection(Of BuiltInCategory)
)
public:
ElementMulticategoryFilter(
	ICollection<BuiltInCategory>^ categories
)
new :
        categories : ICollection<BuiltInCategory> -> ElementMulticategoryFilter
Parameters
categories ICollection<BuiltInCategory>
 The built-in categories to match.
See Also
Reference
ElementMulticategoryFilter Class
ElementMulticategoryFilter Overload
Autodesk.Revit.DB Namespace